## Plans :heavy_check_mark:

<details>
  <summary><h2>Terrateam Plan Output :heavy_check_mark:</h2></summary>

**Dir**: .
**Workspace**: default
**Success**: :heavy_check_mark:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.example_aws.module.batch.aws_batch_compute_environment.this["fargate_spot"] must be replaced
-/+ resource "aws_batch_compute_environment" "this" {
!       arn                             = "arn:aws:batch:us-east-1:376942697097:compute-environment/fargate_spot-20220825083616475500000009" -> (known after apply)
!       compute_environment_name        = "fargate_spot-20220825083616475500000009" -> "example-scheduled-jobs-fargate_spot" # forces replacement
!       compute_environment_name_prefix = "fargate_spot-" -> (known after apply)
!       ecs_cluster_arn                 = "arn:aws:ecs:us-east-1:376942697097:cluster/fargate_spot-20220825083616475500000009_Batch_68d0c3ab-38c8-3eb7-92a9-5523fe23d032" -> (known after apply)
!       id                              = "fargate_spot-20220825083616475500000009" -> (known after apply)
!       status                          = "VALID" -> (known after apply)
!       status_reason                   = "ComputeEnvironment Healthy" -> (known after apply)
        tags                            = {
            "compute_environments" = "fargate_spot"
            "module"               = "batch"
        }
        # (4 unchanged attributes hidden)

!       compute_resources {
-           bid_percentage     = 0 -> null
!           desired_vcpus      = 0 -> (known after apply)
-           instance_type      = [] -> null
-           min_vcpus          = 0 -> null
-           tags               = {} -> null
            # (4 unchanged attributes hidden)

+           ec2_configuration {
+               image_id_override = (known after apply)
+               image_type        = (known after apply)
            }
        }
    }

  # module.example_aws.module.batch.aws_batch_job_definition.this["example"] must be replaced
-/+ resource "aws_batch_job_definition" "this" {
!       arn                   = "arn:aws:batch:us-east-1:376942697097:job-definition/example-scheduled-jobs:1" -> (known after apply)
!       container_properties  = jsonencode(
!           {
-               environment                  = [] -> null
!               logConfiguration             = {
-                   secretOptions = [] -> null
                    # (2 unchanged elements hidden)
                }
-               mountPoints                  = [] -> null
-               secrets                      = [] -> null
-               ulimits                      = [] -> null
-               volumes                      = [] -> null
                # (5 unchanged elements hidden)
            }
        )
!       id                    = "arn:aws:batch:us-east-1:376942697097:job-definition/example-scheduled-jobs:1" -> (known after apply)
!       name                  = "example-scheduled-jobs" -> "example-scheduled-jobs-example" # forces replacement
-       parameters            = {} -> null
!       revision              = 1 -> (known after apply)
        tags                  = {
            "job_definitions" = "example"
            "module"          = "batch"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.example_aws.module.batch.aws_batch_job_queue.this["fargate_spot"] must be replaced
-/+ resource "aws_batch_job_queue" "this" {
!       arn                   = "arn:aws:batch:us-east-1:376942697097:job-queue/fargate_spot" -> (known after apply)
!       compute_environments  = [
-           "arn:aws:batch:us-east-1:376942697097:compute-environment/fargate_spot-20220825083616475500000009",
        ] -> (known after apply)
!       id                    = "arn:aws:batch:us-east-1:376942697097:job-queue/fargate_spot" -> (known after apply)
!       name                  = "fargate_spot" -> "example-scheduled-jobs-fargate_spot" # forces replacement
!       scheduling_policy_arn = "arn:aws:batch:us-east-1:376942697097:scheduling-policy/fargate_spot" -> (known after apply)
        tags                  = {
            "job_queues" = "fargate_spot"
            "module"     = "batch"
        }
        # (3 unchanged attributes hidden)
    }

  # module.example_aws.module.batch.aws_batch_scheduling_policy.this["fargate_spot"] must be replaced
-/+ resource "aws_batch_scheduling_policy" "this" {
!       arn      = "arn:aws:batch:us-east-1:376942697097:scheduling-policy/fargate_spot" -> (known after apply)
!       id       = "arn:aws:batch:us-east-1:376942697097:scheduling-policy/fargate_spot" -> (known after apply)
!       name     = "fargate_spot" -> "example-scheduled-jobs-fargate_spot" # forces replacement
        tags     = {
            "job_queues" = "fargate_spot"
            "module"     = "batch"
        }
!       tags_all = {
-           "job_queues" = "fargate_spot"
-           "managed-by" = "Terraform"
-           "module"     = "batch"
-           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        } -> (known after apply)

!       fair_share_policy {
-           compute_reservation = 0 -> null
-           share_decay_seconds = 0 -> null
        }
    }

  # module.example_aws.module.eventbridge.aws_cloudwatch_event_rule.this["batch"] will be destroyed
  # (because key ["batch"] is not in for_each map)
-   resource "aws_cloudwatch_event_rule" "this" {
-       arn                 = "arn:aws:events:us-east-1:376942697097:rule/batch-rule" -> null
-       description         = "Every 5 minutes" -> null
-       event_bus_name      = "default" -> null
-       id                  = "batch-rule" -> null
-       is_enabled          = true -> null
-       name                = "batch-rule" -> null
-       schedule_expression = "cron(0/5 * * * ? *)" -> null
-       tags                = {
-           "Name"   = "batch-rule"
-           "module" = "eventbridge"
        } -> null
-       tags_all            = {
-           "Name"       = "batch-rule"
-           "managed-by" = "Terraform"
-           "module"     = "eventbridge"
-           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        } -> null
    }

  # module.example_aws.module.eventbridge.aws_cloudwatch_event_rule.this["example-scheduled-jobs-batch"] will be created
+   resource "aws_cloudwatch_event_rule" "this" {
+       arn                 = (known after apply)
+       description         = "Every 5 minutes"
+       event_bus_name      = "default"
+       id                  = (known after apply)
+       is_enabled          = true
+       name                = "example-scheduled-jobs-batch-rule"
+       name_prefix         = (known after apply)
+       schedule_expression = "cron(0/5 * * * ? *)"
+       tags                = {
+           "Name"   = "example-scheduled-jobs-batch-rule"
+           "module" = "eventbridge"
        }
+       tags_all            = {
+           "Name"       = "example-scheduled-jobs-batch-rule"
+           "managed-by" = "Terraform"
+           "module"     = "eventbridge"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
    }

  # module.example_aws.module.eventbridge.aws_cloudwatch_event_target.this["example-scheduled-jobs-fargate_spot"] will be created
+   resource "aws_cloudwatch_event_target" "this" {
+       arn            = (known after apply)
+       event_bus_name = "default"
+       id             = (known after apply)
+       role_arn       = "arn:aws:iam::376942697097:role/example-scheduled-jobs-eventbridge"
+       rule           = "example-scheduled-jobs-batch-rule"
+       target_id      = (known after apply)

+       batch_target {
+           job_definition = (known after apply)
+           job_name       = "example-scheduled-jobs-example"
        }
    }

  # module.example_aws.module.eventbridge.aws_cloudwatch_event_target.this["fargate_spot"] will be destroyed
  # (because key ["fargate_spot"] is not in for_each map)
-   resource "aws_cloudwatch_event_target" "this" {
-       arn            = "arn:aws:batch:us-east-1:376942697097:job-queue/fargate_spot" -> null
-       event_bus_name = "default" -> null
-       id             = "batch-rule-terraform-20220825143630396000000001" -> null
-       role_arn       = "arn:aws:iam::376942697097:role/example-scheduled-jobs-eventbridge" -> null
-       rule           = "batch-rule" -> null
-       target_id      = "terraform-20220825143630396000000001" -> null

-       batch_target {
-           array_size     = 0 -> null
-           job_attempts   = 0 -> null
-           job_definition = "arn:aws:batch:us-east-1:376942697097:job-definition/example-scheduled-jobs:1" -> null
-           job_name       = "example-scheduled-jobs" -> null
        }
    }

Plan: 6 to add, 0 to change, 6 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:. workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 76.65 | 76.65 | 0.00|
| | **Total** | **76.65** | **76.65** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>

